In [1]:
pwd

'C:\\Users\\sagar'

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('titanic.csv')

In [8]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Missing data completely at Random: MCAR

there is a relationship between the data.

In [31]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,0
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,0

### Missing data not at random(MNAR) : Systematic missing Values 

there is no relationship between the data.

In [23]:
import numpy as np
df['cabin_null']=np.where(df['Cabin'].isnull(),1,0)

## whereever there is a nan value, it is true and it will be replaced as 1, and if it is false it will be replaced as 0. 
##find the percentage of Nan Values 

df['cabin_null'].mean()

## add all the 1's, then divide by total number of numbers to get mean.

0.7710437710437711

In [22]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'cabin_null'],
      dtype='object')

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [29]:
## Logically, for a survived person we should not have the missing value, and we are going to check it with the function groupby


df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [30]:
### Missing data at Random (MAR)
Men-- hide their Salary 
Women-- hide their age
# Maybe they are leing, or dont want to provide correct input, consider going to the hospital and saying that you are not smoking
# when you are doing it, and such examples.

In [36]:
### All the Techniques of handling the missing values 

1. Mean Median Mode Replacement 
2. Random Sample Imputation
3. Capturing NAN values wth a new feature
4. End of Distribution imputation 
5. Arbitary imputation
6. Frequent Categories imputation

SyntaxError: invalid syntax (<ipython-input-36-5b9dfed2a6f4>, line 3)

### Mean/ Median / Mode imputation

When should we apply ?? 

Mean/Median imputation has the assumption that the data are missing completely at Random (MCAR). 
Solve this by replacing the Nan, with the most frequent occurence of the variables.

In [37]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [38]:
## lets go and see the percentage of missing values

In [39]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

## now, we are selecting median to go ahead in this particular case, because the mean will take into account the outliers. 
so, it is better to use the median for Age, as median is something which is the most repeated number in that column dataset. 

we are defning a function by using three parameters, i.e data, variable(creating a new variable and showing in the column) and applying which method we want to use(median in this case) to substitute in the missing data.

In [40]:
def impute_nan(df,variable,median):
    df[variable+"_bakchodi"]=df[variable].fillna(median)

In [41]:
df.median()

Survived     0.0000
Age         28.0000
Fare        14.4542
dtype: float64

In [42]:
df['Age'].median

<bound method Series.median of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64>

In [43]:
median=df.Age.median()

In [44]:
median

28.0

In [45]:
impute_nan(df,'Age',median)

## all the nan values will be replaced by the median values.

In [48]:
df.head()

   Survived   Age     Fare  Age_bakchodi
0         0  22.0   7.2500          22.0
1         1  38.0  71.2833          38.0
2         1  26.0   7.9250          26.0
3         1  35.0  53.1000          35.0
4         0  35.0   8.0500          35.0

In [58]:
print(df['Age'].std())
print(df['Age_bakchodi'].std())

14.526497332334044
13.019696550973194

In [59]:
import matplotlib as plt
%matplotlib inline

In [61]:
fig = plt.figure()
ax = fig.add_subplot(111)
df['Age'].plot(kind='kde', ax=ax)
df.Age_bakchodi.plot(kind='kde',ax=ax, color='red')
lines, labels= ax.get_legend_handles_labels()
ax.legend(lines, lables, loc='best')

TypeError: 'module' object is not callable

### advantages and disadvantages of Mean/median/mode imputation 

## Advantages
1. Easy to implement(Robust to outliers). 
2. Faster way to obtain the complete dataset.

## Disadvantages 
1. change or distortion in the original variance.
2. Impacts correlation.